interFoam/L474W45Q60GFill20Hmesh200/0.orig/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{

    "(bottom|frontAndBack|cylinder)"
    {
        type            zeroGradient;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    outletWater
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    outletAir
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
        /*
        type            zeroGradient;
        value           uniform 0;
        */
        
    }

    inlet
    {
        type            variableHeightFlowRate;
        lowerBound      0;
        upperBound      1;
        value           uniform 0;
	}
}


// ************************************************************************* //
